

* Raw data summary

  Discover what I have in my data:

  #+BEGIN_SRC R :session :tangle descriptive.R
    print(names(raop.df))
  #+END_SRC

  #+RESULTS:
  | giver_username_if_known                              |
  | in_test_set                                          |
  | number_of_downvotes_of_request_at_retrieval          |
  | number_of_upvotes_of_request_at_retrieval            |
  | post_was_edited                                      |
  | request_id                                           |
  | request_number_of_comments_at_retrieval              |
  | request_text                                         |
  | request_text_edit_aware                              |
  | request_title                                        |
  | requester_account_age_in_days_at_request             |
  | requester_account_age_in_days_at_retrieval           |
  | requester_days_since_first_post_on_raop_at_request   |
  | requester_days_since_first_post_on_raop_at_retrieval |
  | requester_number_of_comments_at_request              |
  | requester_number_of_comments_at_retrieval            |
  | requester_number_of_comments_in_raop_at_request      |
  | requester_number_of_comments_in_raop_at_retrieval    |
  | requester_number_of_posts_at_request                 |
  | requester_number_of_posts_at_retrieval               |
  | requester_number_of_posts_on_raop_at_request         |
  | requester_number_of_posts_on_raop_at_retrieval       |
  | requester_number_of_subreddits_at_request            |
  | requester_received_pizza                             |
  | requester_subreddits_at_request                      |
  | requester_upvotes_minus_downvotes_at_request         |
  | requester_upvotes_minus_downvotes_at_retrieval       |
  | requester_upvotes_plus_downvotes_at_request          |
  | requester_upvotes_plus_downvotes_at_retrieval        |
  | requester_user_flair                                 |
  | requester_username                                   |
  | unix_timestamp_of_request                            |
  | unix_timestamp_of_request_utc                        |

  Split for better print.

  First 15th

   #+BEGIN_SRC R :session :tangle descriptive.R :results none
     print(summary(raop.df[,1:15]))
   #+END_SRC
   
   #+BEGIN_SRC R :session :tangle descriptive.R :results none
     print(summary(raop.df[,15:33]))
   #+END_SRC

